"""
This module contains a simple greeting message.

It demonstrates basic Python printing functionality and serves as an introduction
to Python programming.
"""

print('Привет, Владимир! Меня зовут Семён, я перевелся к вам в группу в сентябре. Как видишь я отстаю от программы на 11 занятий, но \n\n я обязательно догоню вас, я занимаюсь почти каждый день (с пн-пт), а по выходным работаю в доставке. Информация усваивается не легко,\n\n но нейросети меня спсают, не знаю чтобы я без них делал. Особенно в этом занятии я погарел с терминалом, воевал часа 2, пришлось\n\n выжать tabnine до последней капли, потому что при попытке ввести любую команду выскакивал красный текст ошибки, но я победил. Блок\n\n фронтэнда был очень полезный, узнал много нового. Надеюсь пайтн будет полегче чем js, хотя смотря на этот терминал мои надежды\n\n пропадают. Летом закончил университет и решил что работа на нефтезаводе это не то о чем я мечтал, и решил пойти учиться в "Топ"\n\n академию чтобы получить возможность на хорошее будущее и работу. Я уверен что смогу доучиться, хоть и бывает сложно, но без этого никуда.')
